---
title: AngularDimension
classe: Autodesk.Revit.DB.AngularDimension
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Dimension
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# AngularDimension

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AngularDimension Create(Document, View, Arc, IList<Reference>, DimensionType)` | `AngularDimension.Create(document, dbView, arc, references, dimensionStyle)` | AngularDimension |
| `Void SetAngularRadius(Double)` | `angularDimension.SetAngularRadius(radius)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```